# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [30]:
# Your code here
# Importamos librerías
import pandas as pd

In [31]:
# Url y df cargados
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

In [32]:
# Visualizamos
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [33]:
# Cambiamos los nombres de las columnas
for col in df:
    df.rename(columns={col: str(col).lower().replace(" ", "_")}, inplace=True)

# Modificamos el nombre de `st` por `state``
df.rename(columns={"st": "state"}, inplace=True)

# Visualizamos
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [34]:
# Your code here
# Map a `gender``
gender_mapping = {'Male': 'M', 'female': 'F', 'Femal': 'F', 'F': 'F', 'M': 'M'}
df['gender'] = df['gender'].map(gender_mapping)
print(df['gender'].value_counts())
df.head()

gender
F    502
M    452
Name: count, dtype: int64

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [35]:
# Primero vemos cuáles son los valores que hay con abreviaturas
print(df["state"].value_counts())

# Map a `state`
state_mapping = {
    'Cali': 'California', 
    'WA': 'Washington', 
    'AZ': 'Arizona',
    'California': 'California',
    'Arizona': 'Arizona',
    'Oregon': 'Oregon',
    'Washington': 'Washington',
    'Nevada': 'Nevada'
    }

df['state'] = df['state'].map(state_mapping)
print(df['state'].value_counts())
df.head()

state
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64
state
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [36]:
# Primero vemos los valores que existen
print(df["education"].value_counts())

# Ahora creamos el dict

education_mapping = {
    'Bachelor': 'Bachelor',
    'College': 'College',
    'High School or Below': 'High School or Below',
    'Master': 'Master',
    'Doctor': 'Doctor',
    'Bachelors': 'Bachelor'
}

# Map

df["education"] = df["education"].map(education_mapping)

# Comprobamos
print(df.head())
print(df["education"].value_counts())

education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64
  customer       state gender             education customer_lifetime_value  \
0  RB50392  Washington    NaN                Master                     NaN
1  QZ44356     Arizona      F              Bachelor              697953.59%
2  AI49188      Nevada      F              Bachelor             1288743.17%
3  WW63253  California      M              Bachelor              764586.18%
4  GA49547  Washington      M  High School or Below              536307.65%

    income  monthly_premium_auto number_of_open_complaints     policy_type  \
0      0.0                1000.0                    1/0/00   Personal Auto
1      0.0                  94.0                    1/0/00   Personal Auto
2  48767.0                 108.0                    1/0/00   Personal Auto
3      0.0                 106.0                    1/0/00  Corporate Auto
4  36357.0                  68.0                    1/0/00   Personal Auto

   vehicle_class  total_claim_amount
0  Four-Door Car            2.704934
1  Four-Door Car         1131.464935
2   Two-Door Car          566.472247
3            SUV          529.881344
4  Four-Door Car           17.269323
education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

In [37]:
# Directamente asignamos al valor de "customer_life_value" el replace

df["customer_lifetime_value"] = df["customer_lifetime_value"].str.replace("%", "")

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [38]:
# Vemos valores
print(df["vehicle_class"].value_counts())

# Creamos dict
vehicle_mapping = {
    'Four-Door Car': 'Four-Door Car',
    'Two-Door Car': 'Two-Door Car',
    'SUV': 'SUV',
    'Sports Car': 'Luxury',
    'Luxury SUV': 'Luxury',
    'Luxury Car': 'Luxury'
}

# Map
df["vehicle_class"] = df["vehicle_class"].map(vehicle_mapping)

# Visualizamos
print(df.head())

print(df["vehicle_class"].value_counts())

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64
  customer       state gender             education customer_lifetime_value  \
0  RB50392  Washington    NaN                Master                     NaN
1  QZ44356     Arizona      F              Bachelor               697953.59
2  AI49188      Nevada      F              Bachelor              1288743.17
3  WW63253  California      M              Bachelor               764586.18
4  GA49547  Washington      M  High School or Below               536307.65

    income  monthly_premium_auto number_of_open_complaints     policy_type  \
0      0.0                1000.0                    1/0/00   Personal Auto
1      0.0                  94.0                    1/0/00   Personal Auto
2  48767.0                 108.0                    1/0/00   Personal Auto
3      0.0                 106.0                    1/0/00  Corporate Auto
4  36357.0                  68.0                    1/0/00   Personal Auto

   vehicle_class  total_claim_amount
0  Four-Door Car            2.704934
1  Four-Door Car         1131.464935
2   Two-Door Car          566.472247
3            SUV          529.881344
4  Four-Door Car           17.269323
vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: count, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

Hint:

Customer lifetime value should be numeric
Number of open complaints has an incorrect format. Look at the different values it takes with unique() and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.

In [39]:
# Your code here

# Primero nos cercioramos de los tipos de datos

print(df.dtypes)

# Visualizamos `customer_lifetime_value``

print(df["customer_lifetime_value"])

# Convertimos

df["customer_lifetime_value"] = pd.to_numeric(df["customer_lifetime_value"], errors="coerce")

df["customer_lifetime_value"]

# Verificamos

print(df.dtypes)

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object
0              NaN
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
4003           NaN
4004           NaN
4005           NaN
4006           NaN
4007           NaN
Name: customer_lifetime_value, Length: 4008, dtype: object
customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [40]:
# Observamos

print(df["number_of_open_complaints"].unique())

# Comprobamos valores únicos

print(df["number_of_open_complaints"].value_counts())

# Dict

open_complaints_mapping = {
    "1/0/00": 0,
    "1/1/00": 1,
    "1/2/00": 2,
    "1/3/00": 3,
    "1/4/00": 4,
    "1/5/00": 5
}

df["number_of_open_complaints"] = df["number_of_open_complaints"].map(open_complaints_mapping)

# Comprobamos

print(df["number_of_open_complaints"].value_counts())


# Comvertimos a `int`

df["number_of_open_complaints"] = pd.to_numeric(df["number_of_open_complaints"], errors="coerce")

# Comprobamos

print(df["number_of_open_complaints"].value_counts())


# Comvertimos a `int`

df["number_of_open_complaints"] = pd.to_numeric(df["number_of_open_complaints"], errors="coerce")

# Comprobamos

print(df["number_of_open_complaints"].value_counts())

['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]
number_of_open_complaints
1/0/00    830
1/1/00    138
1/2/00     50
1/3/00     34
1/4/00     13
1/5/00      6
Name: count, dtype: int64
number_of_open_complaints
0.0    830
1.0    138
2.0     50
3.0     34
4.0     13
5.0      6
Name: count, dtype: int64
number_of_open_complaints
0.0    830
1.0    138
2.0     50
3.0     34
4.0     13
5.0      6
Name: count, dtype: int64
number_of_open_complaints
0.0    830
1.0    138
2.0     50
3.0     34
4.0     13
5.0      6
Name: count, dtype: int64

In [41]:
# Finally, since it should be numeric, cast the column to be in its proper type.
# Para convertir de verdad a `int` hace falta utilizar to_nomeric y especificar con astype("Int64")

df["number_of_open_complaints"] = pd.to_numeric(df["number_of_open_complaints"], errors="coerce").astype("Int64")

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [42]:
# Your code here
# Primero miramos el número número de nulos de cada columna
df.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [43]:
# Porcentaje de nulos
df.isnull().sum()/len(df)*100

customer                     73.278443
state                        73.278443
gender                       76.197605
education                    73.278443
customer_lifetime_value      73.353293
income                       73.278443
monthly_premium_auto         73.278443
number_of_open_complaints    73.278443
policy_type                  73.278443
vehicle_class                73.278443
total_claim_amount           73.278443
dtype: float64

In [44]:
# Creamos un dataframe dejando los nulos desde la fila 1071
# Al ser un filtrado con loc usamos df.copy()

df = df.loc[0:1070]
df = df.copy()

# Comprobamos

df.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [45]:
# Miramos los valores NaN con value_counts(dropna=False) dado 
# que value_counts excluye por defecto los nulos como (dropna=True)
print(df["gender"].value_counts(dropna=False))
print(df["customer_lifetime_value"].value_counts(dropna=False))

# Miramos la frecuencia para valores categóricos
df.describe(include=object).T

gender
F      502
M      452
NaN    117
Name: count, dtype: int64
customer_lifetime_value
445811.34     4
251459.20     4
NaN           3
2412750.40    3
684615.03     3
             ..
1210120.88    1
245357.08     1
507566.27     1
321497.94     1
899704.02     1
Name: count, Length: 1028, dtype: int64

              count unique            top freq
customer       1071   1071        RB50392    1
state          1071      5     California  331
gender          954      2              F  502
education      1071      5       Bachelor  331
policy_type    1071      3  Personal Auto  780
vehicle_class  1071      4  Four-Door Car  576

In [46]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
customer_lifetime_value,1068.0,793690.259345,643478.410278,200435.07,403407.995,588174.235,896287.1975,5816655.35
income,1071.0,39295.701214,30469.42706,0.0,14072.0,36234.0,64631.0,99960.0
monthly_premium_auto,1071.0,193.23436,1601.190369,61.0,68.0,83.0,109.5,35354.0
number_of_open_complaints,1071.0,0.394024,0.883769,0.0,0.0,0.0,0.0,5.0
total_claim_amount,1071.0,404.986909,293.02726,0.382107,202.157702,354.729129,532.8,2893.239678

In [47]:
# Moda
df["gender"].mode()

0    F
Name: gender, dtype: object

In [48]:
# Aplicamos moda a los valores categóricos para rellenar valores nulos

df["gender"] = df["gender"].fillna(df["gender"].mode()[0])

# Aplicamos la mediana para el valor numérico que queda

df["customer_lifetime_value"] = df["customer_lifetime_value"].fillna(df["customer_lifetime_value"].describe()["50%"])

In [49]:
# Comprobamos

df.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [50]:
# Convertimos todos los valores numéricos a int64, pero 
# primero miramos los que lo son

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     1071 non-null   object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1071 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   Int64
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: Int64(1), float64(4), object(6)
memory usage: 93.2+ KB

In [64]:
# Convertimos a `int` todos los valores numéricos: hace falta round() porque si no no se puede castear a Int64
# Un dtype entero solo puede guardar números exactos. En pandas se fuerza a que elijamos explícitamente

df["customer_lifetime_value"] = pd.to_numeric(df["customer_lifetime_value"], errors="coerce").round().astype("Int64")
df["income"] = pd.to_numeric(df["income"], errors="coerce").round().astype("Int64")
df["monthly_premium_auto"] = pd.to_numeric(df["monthly_premium_auto"], errors="coerce").round().astype("Int64")
df["total_claim_amount"] = pd.to_numeric(df["total_claim_amount"], errors="coerce").round().astype("Int64")

# Comprobamos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1068 non-null   Int64
 5   income                     1071 non-null   Int64
 6   monthly_premium_auto       1071 non-null   Int64
 7   number_of_open_complaints  1071 non-null   Int64
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   Int64
dtypes: Int64(5), object(6)
memory usage: 364.1+ KB

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [55]:
# Your code here
# Usamos duplicated() para ver si hay o no duplicados:
df.duplicated().sum()

df.to_csv('dataset_clean.csv', index=False)

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [59]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [61]:
# Your code here

# En este script creamos las funciones para cleaning y formatting

from data_cleaning_functions import clean_all
import pandas as pd

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

df_clean = clean_all(df)

df_clean

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<NA>,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<NA>,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<NA>,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<NA>,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<NA>,NaN,NaN,NaN

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here

df[["total_claim_amount", "customer_lifetime_value"]].describe()

# Calcular percentiles
p75_claim = df['total_claim_amount'].quantile(0.75)
p25_clv = df['customer_lifetime_value'].quantile(0.25)

# Filtrar
df_problema = df[(df['total_claim_amount'] > p75_claim) & (df['customer_lifetime_value'] < p25_clv)]

# Estadiísticas filtradas

df_problema[['total_claim_amount', 'customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count                40.0                     40.0
mean              723.725               341577.875
std            149.278262             56921.475939
min                 538.0                 228760.0
25%                633.75                 304220.5
50%                 685.0                 365995.5
75%                 799.0                 387365.0
max                1186.0                 402381.0